app/controllers/tabs_controller.rb

SELECT * FROM "tabs"
---
  def index
    @tabs = Tab.all

SELECT * FROM "tabs" WHERE ("tabs"."id" = 1)
---
  def show
    @tab = Tab.find(params[:id])

SELECT * FROM "tabs" WHERE ("tabs"."id" = 1)
---
  def edit
    @tab = Tab.find(params[:id])

INSERT INTO "tabs" ("name", "created_at", "updated_at") VALUES('Jack', '2009-12-15 18:06:22', '2009-12-15 18:06:22')
---
  def create
    @tab = Tab.new(params[:tab])

    respond_to do |format|
      if @tab.save

SELECT * FROM "tabs" WHERE ("tabs"."id" = 1)
UPDATE "tabs" SET "name" = 'Nurse', "updated_at" = '2009-12-15 18:06:44' WHERE "id" = 1
---
  def update
    @tab = Tab.find(params[:id])

    respond_to do |format|
      if @tab.update_attributes(params[:tab])

SELECT * FROM "tabs" WHERE ("tabs"."id" = 2)
DELETE FROM "tabs" WHERE "id" = 2
---
  def destroy
    @tab = Tab.find(params[:id])
    @tab.destroy